--Лабораторна робота 1
--студентки групи КН-31 підгрупи 1
--Варіант 11

--Завдання 1. Навести приклад виразів вказаного типу: [([Char],[Integer])] 
-- [(['as'],[123])]
-- [(['dffd fff fg'],[67]), (['dd'],[9])]
-- [("dgdg",[123])]


--Завдання 2. Створити функцію, яка визначає, чи мiстить круг початок координат.
-- Круг задається координатами центра та радiусом.

-- Формула круга: (x-x0)^2+(y-y0)^2<=r^2
-- Замість х підмтавляємо точку (0,0), та отримаєми значення дійсне, якщо центр координат входить до круга, і хибне якщо ні.

--2.1 З одним аргументом-кортежем

f1::(Integer,Integer,Integer)->Bool
f1(x,y,r)= x^2+y^2<=r^2

--2.2 Без використання кортежiв чи спискiв
f2:: Integer->Integer->Integer->Bool
f2 x y r = x^2+y^2<=r^2

--Висновок: У ході виконання лабораторної роботи було створено функцію, що перевіряє, чи належить початок координат заданому колу.